programming/conditional-lisp-macros.org
#+TITLE: Replacing conditional Lisp primitives with macros
#+AUTHOR: 8dcc
#+STARTUP: nofold
#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="../img/favicon.png" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css" />
#+HTML_LINK_UP: index.html
#+HTML_LINK_HOME: ../index.html

* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:

Some months ago I started writing [[https://github.com/8dcc/sl][my own Lisp]]. I decided to implement the =or= and
=and= procedures as /special form/ C primitives, but I wanted to explain in the
documentation that they don't /need/ to be C primitives, since we can define them
as macros that use =if=. When writing the example for the documentation, I wrote a
few different alternatives that I consider worth sharing here.

Before getting into the macros, I will briefly explain some of these
concepts. Keep in mind that I will be referring to these concepts in the context
of a Lisp interpreter written in C, more specifically on the Lisp syntax used in
my interpreter.

** Primitives
:PROPERTIES:
:CUSTOM_ID: primitives
:END:

Even though the user can define his own functions, at some point the interpreter
will have to translate them to machine instructions that run on the actual
hardware. What this means is that, even thought the user can write:

#+begin_src lisp
(defun square (x)
  (* x x))

(square 5)
#+end_src

At some point the Lisp has to multiply the numbers, either with another Lisp
procedure that uses, for example, addition; or with actual CPU instructions.

These basic building blocks, like arithmetic functions, are called
/primitives/. In my case they are built into the interpreter as C functions.

** Special Forms
:PROPERTIES:
:CUSTOM_ID: special-forms
:END:

Lisp follows a general evaluation process when calling a procedure. Usually,
when the user calls a function =func= with the following arguments:

#+begin_src lisp
(defun func (arg0 arg1 arg2)
  (format "%d %f %s" arg0 arg1 arg2)) ; Sample body

(func 1 (+ 3 4.0) "foo")
#+end_src

The following process is performed:

1. Each argument is evaluated. The integer =1= evaluates to itself; the list =(+ 3
   4)= is treated as a procedure call, and returns 7.0; and the string ="foo"=
   evaluates to itself.
2. The evaluated arguments are bound to the /formal arguments/. In this case =arg0=,
   =arg1= and =arg2=, respectively.
3. Each expression in the body of the procedure is evaluated, returning the last
   result. In this case, the string returned by =format= is also returned by =func=.

However, some exceptions have to be made. For example, we can't define =if= as a
normal procedure because its 3 arguments would be evaluated before the call,
when in reality only the second or the third argument should be evaluated
depending on the first one:

#+begin_src lisp
(defun my-if (predicate consequent alternative)
  ...)

(my-if tru
       (define var 1)
       (define var 2))
#+end_src

In the previous example =var= would be defined to 2 because all three arguments
were evaluated before the procedure call was made. In this case, it's assumed
that the arguments are evaluated in order, which is true in my Lisp, but isn't
guaranteed in most interpreters.

These special procedures that don't follow normal evaluation rules are called
/special forms/.

** Macros
:PROPERTIES:
:CUSTOM_ID: macros
:END:

Macros in my Lisp are inspired by [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Macros.html][Emacs Lisp macros]]. Macros are similar to
procedures, but have a few key differences:

1. When a macro is called, the arguments are *not* evaluated before applying it,
   so the macro can operate on the un-evaluated expressions directly, instead of
   on the values they compute. The first step of a macro call is binding the
   un-evaluated arguments to the formals.
2. Macros don't /directly/ compute values, they instead build Lisp expressions
   that will be used to compute the actual values. The second step of a macro
   call is the /macro expansion/. In this step, the macro is called just like a
   lambda, returning a Lisp expression.
3. The last step of a macro call is evaluating the expanded expression, which
   will be used to compute the actual value returned by the macro.

In other words the general process when calling a procedure is:

#+NAME: example1
#+begin_example
Evaluate arguments -> Bind arguments -> Evaluate body
                      `-----------------------------´
                                 (Apply)
#+end_example

While the process of calling a macro is:

#+NAME: example2
#+begin_example
Bind arguments -> Evaluate body -> Evaluate expansion
`-----------------------------´
            (Expand)
#+end_example

For example:

#+begin_src lisp
(defmacro my-macro (name)
  (list 'define name 123))
  ⇒ <macro>

(my-macro some-name)
  ⇒ 123

(macroexpand '(my-macro some-name))
  ⇒ (define some-name 123)

some-name
  ⇒ 123
#+end_src

* The =or= macro
:PROPERTIES:
:CUSTOM_ID: the-or-macro
:END:

First, the expected behavior of =or=:

1. When called with no arguments, =nil= is returned. This is the expected behavior
   in Scheme and in my Lisp.
2. Each argument is evaluated in order. If one of them is non-nil, stop
   evaluating and return it.
3. If all arguments are =nil=, then =nil= is returned.

