programming/conditional-lisp-macros.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Replacing conditional Lisp primitives with macros</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Replacing conditional Lisp primitives with macros</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a>
<ul>
<li><a href="#primitives">1.1. Primitives</a></li>
<li><a href="#special-forms">1.2. Special Forms</a></li>
<li><a href="#macros">1.3. Macros</a></li>
</ul>
</li>
<li><a href="#the-or-macro">2. The <code>or</code> macro</a>
<ul>
<li><a href="#version-1">2.1. Version 1</a></li>
<li><a href="#version-2">2.2. Version 2</a></li>
<li><a href="#version-3">2.3. Version 3</a></li>
</ul>
</li>
<li><a href="#the-and-macro">3. The <code>and</code> macro</a></li>
<li><a href="#final-note">4. Final note</a></li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
Some months ago I started writing <a href="https://github.com/8dcc/sl">my own Lisp</a>. I decided to implement the <code>or</code> and
<code>and</code> procedures as <i>special form</i> C primitives, but I wanted to explain in the
documentation that they don&rsquo;t <i>need</i> to be C primitives, since we can define them
as macros that use <code>if</code>. When writing the example for the documentation, I wrote a
few different alternatives that I consider worth sharing here.
</p>

<p>
Before getting into the macros, I will briefly explain some of these
concepts. Keep in mind that I will be referring to these concepts in the context
of a Lisp interpreter written in C, more specifically on the Lisp syntax used in
my interpreter.
</p>
</div>

<div id="outline-container-primitives" class="outline-3">
<h3 id="primitives"><span class="section-number-3">1.1.</span> Primitives</h3>
<div class="outline-text-3" id="text-primitives">
<p>
Even though the user can define his own functions, at some point the interpreter
will have to translate them to machine instructions that run on the actual
hardware. What this means is that, even thought the user can write:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">defun</span> <span style="color: #4ae2ff;">square</span> <span style="color: #cabf00;">(</span>x<span style="color: #cabf00;">)</span>
  <span style="color: #cabf00;">(</span>* x x<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>

<span style="color: #ff5f59;">(</span>square <span style="color: #88ca9f;">5</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
At some point the Lisp has to multiply the numbers, either with another Lisp
procedure that uses, for example, addition; or with actual CPU instructions.
</p>

<p>
These basic building blocks, like arithmetic functions, are called
<i>primitives</i>. In my case they are built into the interpreter as C functions.
</p>
</div>
</div>

<div id="outline-container-special-forms" class="outline-3">
<h3 id="special-forms"><span class="section-number-3">1.2.</span> Special Forms</h3>
<div class="outline-text-3" id="text-special-forms">
<p>
Lisp follows a general evaluation process when calling a procedure. Usually,
when the user calls a function <code>func</code> with the following arguments:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">defun</span> <span style="color: #4ae2ff;">func</span> <span style="color: #cabf00;">(</span>arg0 arg1 arg2<span style="color: #cabf00;">)</span>
  <span style="color: #cabf00;">(</span>format <span style="color: #00d3d0;">"%d %f %s"</span> arg0 arg1 arg2<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span> <span style="color: #989898;">; Sample body</span>

<span style="color: #ff5f59;">(</span>func <span style="color: #88ca9f;">1</span> <span style="color: #cabf00;">(</span>+ <span style="color: #88ca9f;">3</span> <span style="color: #88ca9f;">4.0</span><span style="color: #cabf00;">)</span> <span style="color: #00d3d0;">"foo"</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
The following process is performed:
</p>

<ol class="org-ol">
<li>Each argument is evaluated. The integer <code>1</code> evaluates to itself; the list <code>(+ 3
   4)</code> is treated as a procedure call, and returns 7.0; and the string <code>"foo"</code>
evaluates to itself.</li>
<li>The evaluated arguments are bound to the <i>formal arguments</i>. In this case <code>arg0</code>,
<code>arg1</code> and <code>arg2</code>, respectively.</li>
<li>Each expression in the body of the procedure is evaluated, returning the last
result. In this case, the string returned by <code>format</code> is also returned by <code>func</code>.</li>
</ol>

<p>
However, some exceptions have to be made. For example, we can&rsquo;t define <code>if</code> as a
normal procedure because its 3 arguments would be evaluated before the call,
when in reality only the second or the third argument should be evaluated
depending on the first one:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">defun</span> <span style="color: #4ae2ff;">my-if</span> <span style="color: #cabf00;">(</span>predicate consequent alternative<span style="color: #cabf00;">)</span>
  ...<span style="color: #ff5f59;">)</span>

<span style="color: #ff5f59;">(</span>my-if tru
       <span style="color: #cabf00;">(</span>define var <span style="color: #88ca9f;">1</span><span style="color: #cabf00;">)</span>
       <span style="color: #cabf00;">(</span>define var <span style="color: #88ca9f;">2</span><span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
In the previous example <code>var</code> would be defined to 2 because all three arguments
were evaluated before the procedure call was made. In this case, it&rsquo;s assumed
that the arguments are evaluated in order, which is true in my Lisp, but isn&rsquo;t
guaranteed in most interpreters.
</p>

<p>
These special procedures that don&rsquo;t follow normal evaluation rules are called
<i>special forms</i>.
</p>
</div>
</div>

<div id="outline-container-macros" class="outline-3">
<h3 id="macros"><span class="section-number-3">1.3.</span> Macros</h3>
<div class="outline-text-3" id="text-macros">
<p>
Macros in my Lisp are inspired by <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Macros.html">Emacs Lisp macros</a>. Macros are similar to
procedures, but have a few key differences:
</p>

<ol class="org-ol">
<li>When a macro is called, the arguments are <b>not</b> evaluated before applying it,
so the macro can operate on the un-evaluated expressions directly, instead of
on the values they compute. The first step of a macro call is binding the
un-evaluated arguments to the formals.</li>
<li>Macros don&rsquo;t <i>directly</i> compute values, they instead build Lisp expressions
that will be used to compute the actual values. The second step of a macro
call is the <i>macro expansion</i>. In this step, the macro is called just like a
lambda, returning a Lisp expression.</li>
<li>The last step of a macro call is evaluating the expanded expression, which
will be used to compute the actual value returned by the macro.</li>
</ol>

<p>
In other words the general process when calling a procedure is:
</p>

<pre class="example" id="org60d0b2e">
Evaluate arguments -&gt; Bind arguments -&gt; Evaluate body
                      `-----------------------------´
                                 (Apply)
</pre>

<p>
While the process of calling a macro is:
</p>

<pre class="example" id="org658fdae">
Bind arguments -&gt; Evaluate body -&gt; Evaluate expansion
`-----------------------------´
            (Expand)
</pre>

<p>
For example:
</p>

<div class="org-src-container">
<pre class="src src-lisp">&gt; <span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">defmacro</span> <span style="color: #4ae2ff;">my-macro</span> <span style="color: #cabf00;">(</span>name<span style="color: #cabf00;">)</span>
    <span style="color: #cabf00;">(</span>list 'define name <span style="color: #88ca9f;">123</span><span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
&lt;macro&gt;

&gt; <span style="color: #ff5f59;">(</span>my-macro some-name<span style="color: #ff5f59;">)</span>
<span style="color: #88ca9f;">123</span>

&gt; <span style="color: #ff5f59;">(</span>macroexpand '<span style="color: #cabf00;">(</span>my-macro some-name<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
<span style="color: #ff5f59;">(</span>define some-name <span style="color: #88ca9f;">123</span><span style="color: #ff5f59;">)</span>

&gt; some-name
<span style="color: #88ca9f;">123</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-the-or-macro" class="outline-2">
<h2 id="the-or-macro"><span class="section-number-2">2.</span> The <code>or</code> macro</h2>
<div class="outline-text-2" id="text-the-or-macro">
<p>
First, the expected behavior of <code>or</code>:
</p>

<ol class="org-ol">
<li>When called with no arguments, <code>nil</code> is returned. This is the expected behavior
in Scheme and in my Lisp.</li>
<li>Each argument is evaluated in order. If one of them is non-nil, stop
evaluating and return it.</li>
<li>If all arguments are <code>nil</code>, then <code>nil</code> is returned.</li>
</ol>
</div>
