programming/conditional-lisp-macros.org
** Version 1
:PROPERTIES:
:CUSTOM_ID: version-1
:END:

#+begin_src lisp
(defmacro my-or (&rest exprs)
  (defun or-lst (expr-list)
    (if (null? expr-list)
        nil
        ;; TODO: Don't overwrite "result", generate unique symbol.
        (list (list 'lambda (list 'result)
                    (list 'if 'result 'result
                          (or-lst (cdr expr-list))))
              (car expr-list))))
  (or-lst exprs))
#+end_src

The first version uses an inner =or-lst= procedure to allow easier recursion. Note
that this procedure is not defined globally, the scope is restricted to the body
of the macro. Since =my-or= uses =&rest=, when the macro is called with
=(my-or 'A 'B 'C)=, the list =(A B C)= is bound to the symbol =exprs=. This makes
recursion trickier, because if we call ourselves with =(cdr exprs)=, we are not
doing =(my-or B C)=, but =(my-or '(B C))=, which gets put into another list because
of =&rest=. An easier solution for this "problem" is shown on the next section.

First, it checks the base case, we didn't get any arguments. In that case, =nil=
is returned.

If we got an argument, the macro will expand to a /call/ to a /lambda/ that receives
the evaluated argument. We need to do this to evaluate the expression only
once. An incorrect example:

#+begin_src lisp
(or A B C)

;; Expanded (incorrectly) into:
(if A A
    (if B B
        (if C C
            nil)))
#+end_src

In that example, =A= is evaluated once to get the condition and, if the result is
non-nil, =A= is evaluated a second time as the /consequent/. Instead, the correct
approach is something like:

#+begin_src lisp
(let ((result A))
  (if result
      result
      ...))
#+end_src

In that second example, =A= is evaluated only once. However, since my Lisp didn't
have a =let= macro at this point, I used an uglier (but equivalent) version which
calls an anonymous lambda:

#+begin_src lisp
((lambda (result)
   (if result
       result
       ...))
 A)
#+end_src

As you can probably tell, there is a Big Bug™ in the macro, and it will remain
throughout all versions. The name "result", used as the lambda argument, is far
from unique, so we might overwrite some user value during this call. In a real
implementation, we should use some function like Emacs Lisp's [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Symbols.html#index-gensym][gensym]].

Here are some examples of the macro:

#+begin_src lisp
(my-or nil 'A 'B)
  ⇒ A

(macroexpand '(my-or 'A 'B 'C))  ; God almighty...
  ⇒ ((lambda (result)
       (if result result
         ((lambda (result)
            (if result result
              ((lambda (result)
                 (if result result
                   nil))
               'C)))
          'B)))
     'A)

(my-or)
  ⇒ nil

(macroexpand '(my-or))
  ⇒ nil
#+end_src

Throughout this article I will make some minor changes to the interpreter output
for readability, like formatting the indentation or replacing =(quote expr)= with
='expr=.

