programming/conditional-lisp-macros.html

<div id="outline-container-version-1" class="outline-3">
<h3 id="version-1"><span class="section-number-3">2.1.</span> Version 1</h3>
<div class="outline-text-3" id="text-version-1">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">defmacro</span> <span style="color: #4ae2ff;">my-or</span> <span style="color: #cabf00;">(</span><span style="color: #79a8ff;">&amp;rest</span> exprs<span style="color: #cabf00;">)</span>
  <span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">defun</span> <span style="color: #4ae2ff;">or-lst</span> <span style="color: #44bc44;">(</span>expr-list<span style="color: #44bc44;">)</span>
    <span style="color: #44bc44;">(</span><span style="color: #ff6f9f;">if</span> <span style="color: #00eff0;">(</span>null? expr-list<span style="color: #00eff0;">)</span>
        nil
        <span style="color: #989898;">;; </span><span style="color: #cabf00; font-weight: bold;">TODO:</span><span style="color: #989898;"> Don't overwrite "result", generate unique symbol.</span>
        <span style="color: #00eff0;">(</span>list <span style="color: #338fff;">(</span>list 'lambda <span style="color: #ef7fff;">(</span>list 'result<span style="color: #ef7fff;">)</span>
                    <span style="color: #ef7fff;">(</span>list 'if 'result 'result
                          <span style="color: #ff5f59;">(</span>or-lst <span style="color: #cabf00;">(</span>cdr expr-list<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span><span style="color: #ef7fff;">)</span><span style="color: #338fff;">)</span>
              <span style="color: #338fff;">(</span>car expr-list<span style="color: #338fff;">)</span><span style="color: #00eff0;">)</span><span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
  <span style="color: #cabf00;">(</span>or-lst exprs<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
The first version uses an inner <code>or-lst</code> procedure to allow easier recursion. Note
that this procedure is not defined globally, the scope is restricted to the body
of the macro. Since <code>my-or</code> uses <code>&amp;rest</code>, when the macro is called with
<code>(my-or 'A 'B 'C)</code>, the list <code>(A B C)</code> is bound to the symbol <code>exprs</code>. This makes
recursion trickier, because if we call ourselves with <code>(cdr exprs)</code>, we are not
doing <code>(my-or B C)</code>, but <code>(my-or '(B C))</code>, which gets put into another list because
of <code>&amp;rest</code>. An easier solution for this &ldquo;problem&rdquo; is shown on the next section.
</p>

<p>
First, it checks the base case, we didn&rsquo;t get any arguments. In that case, <code>nil</code>
is returned.
</p>

<p>
If we got an argument, the macro will expand to a <i>call</i> to a <i>lambda</i> that receives
the evaluated argument. We need to do this to evaluate the expression only
once. An incorrect example:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff5f59;">(</span>or A B C<span style="color: #ff5f59;">)</span>

<span style="color: #989898;">;; </span><span style="color: #989898;">Expanded (incorrectly) into:</span>
<span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">if</span> A A
    <span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">if</span> B B
        <span style="color: #44bc44;">(</span><span style="color: #ff6f9f;">if</span> C C
            nil<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
In that example, <code>A</code> is evaluated once to get the condition and, if the result is
non-nil, <code>A</code> is evaluated a second time as the <i>consequent</i>. Instead, the correct
approach is something like:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">let</span> <span style="color: #cabf00;">(</span><span style="color: #44bc44;">(</span>result A<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
  <span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">if</span> result
      result
      ...<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
In that second example, <code>A</code> is evaluated only once. However, since my Lisp didn&rsquo;t
have a <code>let</code> macro at this point, I used an uglier (but equivalent) version which
calls an anonymous lambda:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff5f59;">(</span><span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">lambda</span> <span style="color: #44bc44;">(</span>result<span style="color: #44bc44;">)</span>
   <span style="color: #44bc44;">(</span><span style="color: #ff6f9f;">if</span> result
       result
       ...<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
 A<span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
As you can probably tell, there is a Big Bug™ in the macro, and it will remain
throughout all versions. The name &ldquo;result&rdquo;, used as the lambda argument, is far
from unique, so we might overwrite some user value during this call. In a real
implementation, we should use some function like Emacs Lisp&rsquo;s <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Creating-Symbols.html#index-gensym">gensym</a>.
</p>

<p>
Here are some examples of the macro:
</p>

<div class="org-src-container">
<pre class="src src-lisp">&gt; <span style="color: #ff5f59;">(</span>my-or nil 'A 'B<span style="color: #ff5f59;">)</span>
A

&gt; <span style="color: #ff5f59;">(</span>macroexpand '<span style="color: #cabf00;">(</span>my-or 'A 'B 'C<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>  <span style="color: #989898;">; God almighty...</span>
<span style="color: #ff5f59;">(</span><span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">lambda</span> <span style="color: #44bc44;">(</span>result<span style="color: #44bc44;">)</span>
   <span style="color: #44bc44;">(</span><span style="color: #ff6f9f;">if</span> result result
     <span style="color: #00eff0;">(</span><span style="color: #338fff;">(</span><span style="color: #ff6f9f;">lambda</span> <span style="color: #ef7fff;">(</span>result<span style="color: #ef7fff;">)</span>
        <span style="color: #ef7fff;">(</span><span style="color: #ff6f9f;">if</span> result result
          <span style="color: #ff5f59;">(</span><span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">lambda</span> <span style="color: #44bc44;">(</span>result<span style="color: #44bc44;">)</span>
             <span style="color: #44bc44;">(</span><span style="color: #ff6f9f;">if</span> result result
               nil<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
           'C<span style="color: #ff5f59;">)</span><span style="color: #ef7fff;">)</span><span style="color: #338fff;">)</span>
      'B<span style="color: #00eff0;">)</span><span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
 'A<span style="color: #ff5f59;">)</span>

&gt; <span style="color: #ff5f59;">(</span>my-or<span style="color: #ff5f59;">)</span>
nil

&gt; <span style="color: #ff5f59;">(</span>macroexpand '<span style="color: #cabf00;">(</span>my-or<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
nil
</pre>
</div>

<p>
Throughout this article I will make some minor changes to the interpreter output
for readability, like formatting the indentation or replacing <code>(quote expr)</code> with
<code>'expr</code>.
</p>
</div>
</div>
