programming/conditional-lisp-macros.org
** Version 2
:PROPERTIES:
:CUSTOM_ID: version-2
:END:

#+begin_src lisp
(defmacro my-or (&rest exprs)
  (if (null? exprs)
      nil
      (list (list 'lambda (list 'result)
                  (list 'if 'result 'result
                        ;; The expansion will call `my-or'.
                        (cons 'my-or (cdr exprs))))
            (car exprs))))
#+end_src

This version still uses the lambda call method, but it doesn't use an inner
=or-lst= procedure. Instead, it introduces a call to the macro itself /in the
expansion/.

We use =cons= to append =my-or= to the =cdr= of the argument list, constructing a
function call. We could also use =apply=, but we would have to quote the argument
list to avoid evaluating the =cdr= as another function call:

#+begin_src lisp
;; Incorrect version, the `cadr' will be interpreted as a function.
(list 'apply 'my-or
      (cdr exprs))

;; Correct version.
(list 'apply 'my-or
      (list 'quote (cdr exprs)))

;; Which, assumming `exprs' is (A B C), expands to:
(apply my-or (quote (B C)))

;; Or alternatively:
(apply my-or '(B C))
#+end_src

Some examples of the second version:

#+begin_src lisp
(my-or nil 'A 'B)
  ⇒ A

(macroexpand '(my-or 'A 'B 'C))  ; Much more readable
  ⇒ ((lambda (result)
       (if result result
         (my-or ('B 'C))))
     'A)
#+end_src

** Version 3
:PROPERTIES:
:CUSTOM_ID: version-3
:END:

#+begin_src lisp
(defmacro my-or (&rest exprs)
  (if (null? exprs)
      nil
      (list 'let (list (list 'result (car exprs)))
            (list 'if 'result 'result
                  (cons 'my-or (cdr exprs))))))
#+end_src

Finally, to make the expansion a bit more readable, we can remove that lambda
call by using the =let= macro. This version is probably a bit less efficient since
=let= also expands to a lambda call, but it's more readable.

Some examples of the third version:

#+begin_src lisp
(my-or nil 'A 'B)
  ⇒ A

(macroexpand '(my-or 'A 'B 'C))  ; Much more readable
  ⇒ (let ((result 'A))
      (if result result
        (my-or 'B 'C)))
#+end_src

* The =and= macro
:PROPERTIES:
:CUSTOM_ID: the-and-macro
:END:

This version of =my-and= is based on the third version of =my-or=, so it also
overwrites the =result= symbol.

#+begin_src lisp
(defmacro my-and (&rest exprs)
  (if (null? exprs)
      tru
      (list 'let (list (list 'result (car exprs)))
            (list 'if
                  'result
                  (if (null? (cdr exprs))
                      'result
                      (cons 'my-and (cdr exprs)))
                  nil))))
#+end_src

The first difference is that, when =expr= is empty, =tru= is returned instead of
=nil=. Again, this is the expected behavior in Scheme and in my Lisp.

Then, a conditional is introduced when expanding the macro. Just to be clear,
this conditional, the one that checks if =(cdr exprs)= is empty, will be performed
when the macro is /expanded/, not when the expansion is /evaluated/. This
conditional is needed because, if we reached the last argument, we want to
return it if it's non-nil. If we are not on the last argument, we keep checking
by calling ourselves, just like we did in =my-or=.

#+begin_src lisp
(let ((result 'A))
  (if result
    (my-and 'B 'C)
    nil))
#+end_src

* Final note
:PROPERTIES:
:CUSTOM_ID: final-note
:END:

I will end up adding a 4th version once I add [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Backquote.html][backquote]] support to my Lisp.

Feel free to [[https://github.com/8dcc/8dcc.github.io/issues][contribute]] if you have any suggestions or improvements.
