programming/conditional-lisp-macros.html

<div id="outline-container-version-2" class="outline-3">
<h3 id="version-2"><span class="section-number-3">2.2.</span> Version 2</h3>
<div class="outline-text-3" id="text-version-2">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">defmacro</span> <span style="color: #4ae2ff;">my-or</span> <span style="color: #cabf00;">(</span><span style="color: #79a8ff;">&amp;rest</span> exprs<span style="color: #cabf00;">)</span>
  <span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">if</span> <span style="color: #44bc44;">(</span>null? exprs<span style="color: #44bc44;">)</span>
      nil
      <span style="color: #44bc44;">(</span>list <span style="color: #00eff0;">(</span>list 'lambda <span style="color: #338fff;">(</span>list 'result<span style="color: #338fff;">)</span>
                  <span style="color: #338fff;">(</span>list 'if 'result 'result
                        <span style="color: #989898;">;; </span><span style="color: #989898;">The expansion will call `</span><span style="color: #88ca9f;">my-or</span><span style="color: #989898;">'.</span>
                        <span style="color: #ef7fff;">(</span>cons 'my-or <span style="color: #ff5f59;">(</span>cdr exprs<span style="color: #ff5f59;">)</span><span style="color: #ef7fff;">)</span><span style="color: #338fff;">)</span><span style="color: #00eff0;">)</span>
            <span style="color: #00eff0;">(</span>car exprs<span style="color: #00eff0;">)</span><span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
This version still uses the lambda call method, but it doesn&rsquo;t use an inner
<code>or-lst</code> procedure. Instead, it introduces a call to the macro itself <i>in the
expansion</i>.
</p>

<p>
We use <code>cons</code> to append <code>my-or</code> to the <code>cdr</code> of the argument list, constructing a
function call. We could also use <code>apply</code>, but we would have to quote the argument
list to avoid evaluating the <code>cdr</code> as another function call:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #989898;">;; </span><span style="color: #989898;">Incorrect version, the `</span><span style="color: #88ca9f;">cadr</span><span style="color: #989898;">' will be interpreted as a function.</span>
<span style="color: #ff5f59;">(</span>list 'apply 'my-or
      <span style="color: #cabf00;">(</span>cdr exprs<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>

<span style="color: #989898;">;; </span><span style="color: #989898;">Correct version.</span>
<span style="color: #ff5f59;">(</span>list 'apply 'my-or
      <span style="color: #cabf00;">(</span>list 'quote <span style="color: #44bc44;">(</span>cdr exprs<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>

<span style="color: #989898;">;; </span><span style="color: #989898;">Which, assumming `</span><span style="color: #88ca9f;">exprs</span><span style="color: #989898;">' is (A B C), expands to:</span>
<span style="color: #ff5f59;">(</span>apply my-or <span style="color: #cabf00;">(</span>quote <span style="color: #44bc44;">(</span>B C<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>

<span style="color: #989898;">;; </span><span style="color: #989898;">Or alternatively:</span>
<span style="color: #ff5f59;">(</span>apply my-or '<span style="color: #cabf00;">(</span>B C<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
Some examples of the second version:
</p>

<div class="org-src-container">
<pre class="src src-lisp">&gt; <span style="color: #ff5f59;">(</span>my-or nil 'A 'B<span style="color: #ff5f59;">)</span>
A

&gt; <span style="color: #ff5f59;">(</span>macroexpand '<span style="color: #cabf00;">(</span>my-or 'A 'B 'C<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>  <span style="color: #989898;">; Much more readable</span>
<span style="color: #ff5f59;">(</span><span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">lambda</span> <span style="color: #44bc44;">(</span>result<span style="color: #44bc44;">)</span>
   <span style="color: #44bc44;">(</span><span style="color: #ff6f9f;">if</span> result result
     <span style="color: #00eff0;">(</span>my-or <span style="color: #338fff;">(</span>'B 'C<span style="color: #338fff;">)</span><span style="color: #00eff0;">)</span><span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
 'A<span style="color: #ff5f59;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-version-3" class="outline-3">
<h3 id="version-3"><span class="section-number-3">2.3.</span> Version 3</h3>
<div class="outline-text-3" id="text-version-3">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">defmacro</span> <span style="color: #4ae2ff;">my-or</span> <span style="color: #cabf00;">(</span><span style="color: #79a8ff;">&amp;rest</span> exprs<span style="color: #cabf00;">)</span>
  <span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">if</span> <span style="color: #44bc44;">(</span>null? exprs<span style="color: #44bc44;">)</span>
      nil
      <span style="color: #44bc44;">(</span>list 'let <span style="color: #00eff0;">(</span>list <span style="color: #338fff;">(</span>list 'result <span style="color: #ef7fff;">(</span>car exprs<span style="color: #ef7fff;">)</span><span style="color: #338fff;">)</span><span style="color: #00eff0;">)</span>
            <span style="color: #00eff0;">(</span>list 'if 'result 'result
                  <span style="color: #338fff;">(</span>cons 'my-or <span style="color: #ef7fff;">(</span>cdr exprs<span style="color: #ef7fff;">)</span><span style="color: #338fff;">)</span><span style="color: #00eff0;">)</span><span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
Finally, to make the expansion a bit more readable, we can remove that lambda
call by using the <code>let</code> macro. This version is probably a bit less efficient since
<code>let</code> also expands to a lambda call, but it&rsquo;s more readable.
</p>

<p>
Some examples of the third version:
</p>

<div class="org-src-container">
<pre class="src src-lisp">&gt; <span style="color: #ff5f59;">(</span>my-or nil 'A 'B<span style="color: #ff5f59;">)</span>
A

&gt; <span style="color: #ff5f59;">(</span>macroexpand '<span style="color: #cabf00;">(</span>my-or 'A 'B 'C<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>  <span style="color: #989898;">; Much more readable</span>
<span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">let</span> <span style="color: #cabf00;">(</span><span style="color: #44bc44;">(</span>result 'A<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
  <span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">if</span> result result
    <span style="color: #44bc44;">(</span>my-or 'B 'C<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-the-and-macro" class="outline-2">
<h2 id="the-and-macro"><span class="section-number-2">3.</span> The <code>and</code> macro</h2>
<div class="outline-text-2" id="text-the-and-macro">
<p>
This version of <code>my-and</code> is based on the third version of <code>my-or</code>, so it also
overwrites the <code>result</code> symbol.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">defmacro</span> <span style="color: #4ae2ff;">my-and</span> <span style="color: #cabf00;">(</span><span style="color: #79a8ff;">&amp;rest</span> exprs<span style="color: #cabf00;">)</span>
  <span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">if</span> <span style="color: #44bc44;">(</span>null? exprs<span style="color: #44bc44;">)</span>
      tru
      <span style="color: #44bc44;">(</span>list 'let <span style="color: #00eff0;">(</span>list <span style="color: #338fff;">(</span>list 'result <span style="color: #ef7fff;">(</span>car exprs<span style="color: #ef7fff;">)</span><span style="color: #338fff;">)</span><span style="color: #00eff0;">)</span>
            <span style="color: #00eff0;">(</span>list 'if
                  'result
                  <span style="color: #338fff;">(</span><span style="color: #ff6f9f;">if</span> <span style="color: #ef7fff;">(</span>null? <span style="color: #ff5f59;">(</span>cdr exprs<span style="color: #ff5f59;">)</span><span style="color: #ef7fff;">)</span>
                      'result
                      <span style="color: #ef7fff;">(</span>cons 'my-and <span style="color: #ff5f59;">(</span>cdr exprs<span style="color: #ff5f59;">)</span><span style="color: #ef7fff;">)</span><span style="color: #338fff;">)</span>
                  nil<span style="color: #00eff0;">)</span><span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>

<p>
The first difference is that, when <code>expr</code> is empty, <code>tru</code> is returned instead of
<code>nil</code>. Again, this is the expected behavior in Scheme and in my Lisp.
</p>

<p>
Then, a conditional is introduced when expanding the macro. Just to be clear,
this conditional, the one that checks if <code>(cdr exprs)</code> is empty, will be performed
when the macro is <i>expanded</i>, not when the expansion is <i>evaluated</i>. This
conditional is needed because, if we reached the last argument, we want to
return it if it&rsquo;s non-nil. If we are not on the last argument, we keep checking
by calling ourselves, just like we did in <code>my-or</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ff5f59;">(</span><span style="color: #ff6f9f;">let</span> <span style="color: #cabf00;">(</span><span style="color: #44bc44;">(</span>result 'A<span style="color: #44bc44;">)</span><span style="color: #cabf00;">)</span>
  <span style="color: #cabf00;">(</span><span style="color: #ff6f9f;">if</span> result
    <span style="color: #44bc44;">(</span>my-and 'B 'C<span style="color: #44bc44;">)</span>
    nil<span style="color: #cabf00;">)</span><span style="color: #ff5f59;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-final-note" class="outline-2">
<h2 id="final-note"><span class="section-number-2">4.</span> Final note</h2>
<div class="outline-text-2" id="text-final-note">
<p>
I will end up adding a 4th version once I add <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Backquote.html">backquote</a> support to my Lisp.
</p>

<p>
Feel free to <a href="https://github.com/8dcc/8dcc.github.io/pulls">contribute</a> if you have any suggestions or improvements.
</p>
</div>
</div>
</div>
</body>
</html>
